In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("sheet.csv")

In [3]:
df

     0    1   2    3
0  756  665  66  755
1   47   23   6   75
2  467   43  46   56
3  335   34  54  544

In [4]:
df.iloc[[2,0],[1,3]]

     1    3
2   43   56
0  665  755

In [5]:
dr = df.copy()

In [6]:
df

     0    1   2    3
0  756  665  66  755
1   47   23   6   75
2  467   43  46   56
3  335   34  54  544

In [7]:
dr

     0    1   2    3
0  756  665  66  755
1   47   23   6   75
2  467   43  46   56
3  335   34  54  544

In [8]:
dr.iloc[1,1] = 2

In [9]:
dr

     0    1   2    3
0  756  665  66  755
1   47    2   6   75
2  467   43  46   56
3  335   34  54  544

In [10]:
df

     0    1   2    3
0  756  665  66  755
1   47   23   6   75
2  467   43  46   56
3  335   34  54  544

In [11]:
df.drop(0,axis=0, inplace=True)

In [12]:
df.reset_index(drop=True)

     0   1   2    3
0   47  23   6   75
1  467  43  46   56
2  335  34  54  544

In [13]:
df

     0   1   2    3
1   47  23   6   75
2  467  43  46   56
3  335  34  54  544

In [32]:
newdf = pd.read_csv("sheet.csv")

In [33]:
newdf

     0    1   2    3
0  756  665  66  755
1   47   23   6   75
2  467   43  46   56
3  335   34  54  544

In [34]:
newdf.drop([0,2],axis=0,inplace=True)

In [35]:
newdf.reset_index(drop=True,inplace=True)

In [36]:
newdf

     0   1   2    3
0   47  23   6   75
1  335  34  54  544

In [38]:
newdf.to_csv('sheet1.csv')

In [39]:
newdf

     0   1   2    3
0   47  23   6   75
1  335  34  54  544

In [42]:
newdf.loc[[1],:] = None

In [43]:
newdf

      0     1    2     3
0  47.0  23.0  6.0  75.0
1   NaN   NaN  NaN   NaN

In [46]:
newdf

      0     1    2     3
0  47.0  23.0  6.0  75.0
1   NaN   NaN  NaN   NaN

In [49]:
newdf.isnull()

       0      1      2      3
0  False  False  False  False
1   True   True   True   True